{"UNK": 0, "NONE": 1, "PAD": 2, "andps": 3, "psubusb": 4, "por": 5, "jnz": 6, "fxch4": 7, "pabsw": 8, "bsr": 9, "setl": 10, "paddw": 11, "fxsave": 12, "vmwrite": 13, "bound": 14, "jo": 15, "movhps": 16, "into": 17, "vmovd": 18, "pxor": 19, "vinsertf128": 20, "vmovdqa": 21, "paddsw": 22, "fist": 23, "orps": 24, "vmovapd": 25, "paddusw": 26, "roundps": 27, "fsub": 28, "bsf": 29, "fcmovu": 30, "vorpd": 31, "packuswb": 32, "unpckhpd": 33, "shufpd": 34, "pminuw": 35, "psubq": 36, "arpl": 37, "pandn": 38, "extractps": 39, "vpunpckhbw": 40, "vcvtss2sd": 41, "vpmullw": 42, "bswap": 43, "rcr": 44, "pmovzxbd": 45, "movsd": 46, "lddqu": 47, "movhpd": 48, "packusdw": 49, "jns": 50, "pshuflw": 51, "jnb": 52, "psllw": 53, "cvttps2dq": 54, "cmova": 55, "psrlq": 56, "setnbe": 57, "fcmovbe": 58, "leave": 59, "punpckldq": 60, "ffreep": 61, "phaddd": 62, "cmovb": 63, "insertps": 64, "scas": 65, "cmpps": 66, "sub": 67, "punpckhqdq": 68, "xchg": 69, "fcmovnbe": 70, "rol": 71, "pmulhrsw": 72, "fstsw": 73, "movnti": 74, "jnp": 75, "setz": 76, "int": 77, "minsd": 78, "paddusb": 79, "mulps": 80, "fcompp": 81, "vextractf128": 82, "lar": 83, "psrld": 84, "seto": 85, "vperm2f128": 86, "js": 87, "fadd": 88, "not": 89, "jmp": 90, "lss": 91, "paddq": 92, "fcmovnb": 93, "pfsubr": 94, "psrlw": 95, "punpckhdq": 96, "sqrtss": 97, "jg": 98, "pavgw": 99, "rcpss": 100, "cvtsd2si": 101, "pmaddwd": 102, "ucomisd": 103, "btr": 104, "cmovbe": 105, "vmovsd": 106, "jge": 107, "cmpneqps": 108, "vpaddw": 109, "sbb": 110, "cmovp": 111, "fcomi": 112, "idiv": 113, "pavgusb": 114, "jl": 115, "psubusw": 116, "fsubr": 117, "btc": 118, "pfadd": 119, "pshufb": 120, "addps": 121, "pand": 122, "imul": 123, "lidt": 124, "pshufhw": 125, "movaps": 126, "fild": 127, "lfs": 128, "addsd": 129, "lgs": 130, "addpd": 131, "vmptrst": 132, "vpcmpeqw": 133, "pshufd": 134, "fidivr": 135, "divss": 136, "prefetcht2": 137, "psrldq": 138, "shl": 139, "psraw": 140, "cvtdq2pd": 141, "pcmpgtw": 142, "vmovddup": 143, "subpd": 144, "movsx": 145, "vpcmpgtw": 146, "xor": 147, "fmul": 148, "cmp": 149, "movss": 150, "retnw": 151, "vpextrw": 152, "femms": 153, "rcl": 154, "wait": 155, "pslld": 156, "orpd": 157, "vunpckhps": 158, "pinsrd": 159, "xbegin": 160, "inc": 161, "ficom": 162, "sgdt": 163, "test": 164, "setbe": 165, "mpsadbw": 166, "prefetchnta": 167, "cmpleps": 168, "pcmpeqd": 169, "cmovl": 170, "ffree": 171, "fdivp": 172, "cmpltps": 173, "cvttsd2si": 174, "pmaxub": 175, "vsqrtpd": 176, "fistp": 177, "fnstenv": 178, "punpcklbw": 179, "vpmaddwd": 180, "fxch": 181, "cvtpd2ps": 182, "ucomiss": 183, "setno": 184, "sar": 185, "maxps": 186, "pmuludq": 187, "cvtps2pd": 188, "vpaddusw": 189, "fsubrp": 190, "movlps": 191, "fld1": 192, "jb": 193, "and": 194, "jbe": 195, "pcmpeqw": 196, "fnsave": 197, "cmovo": 198, "out": 199, "frstor": 200, "ldmxcsr": 201, "div": 202, "cvtpi2ps": 203, "mulpd": 204, "add": 205, "pextrw": 206, "movq": 207, "pextrb": 208, "punpcklwd": 209, "shufps": 210, "fdivr": 211, "cvtsd2ss": 212, "adc": 213, "movq2dq": 214, "cmpltpd": 215, "paddb": 216, "cmps": 217, "addss": 218, "vpunpckldq": 219, "pmovzxwd": 220, "vaddps": 221, "cmovno": 222, "pfmul": 223, "pmaxsw": 224, "subss": 225, "cvtsi2ss": 226, "subsd": 227, "cdq": 228, "stmxcsr": 229, "vmptrld": 230, "setnl": 231, "shrd": 232, "push": 233, "or": 234, "fucompp": 235, "cvtdq2ps": 236, "vpshufhw": 237, "fnstsw": 238, "pmulhw": 239, "vmulps": 240, "xlat": 241, "cvtsi2sd": 242, "cmovnp": 243, "subps": 244, "pslldq": 245, "ror": 246, "fcmovne": 247, "pfrcpit1": 248, "mulss": 249, "psadbw": 250, "movmskps": 251, "fcomp": 252, "fnstcw": 253, "jp": 254, "divsd": 255, "movhlps": 256, "fmulp": 257, "fdiv": 258, "pfrcpit2": 259, "jno": 260, "setnz": 261, "fld": 262, "in": 263, "paddd": 264, "cmpeqsd": 265, "str": 266, "lds": 267, "setnb": 268, "aam": 269, "packsswb": 270, "sets": 271, "pminsw": 272, "vdivsd": 273, "xorpd": 274, "faddp": 275, "lldt": 276, "andnpd": 277, "pmovmskb": 278, "fucomp": 279, "retn": 280, "mov": 281, "fsubp": 282, "sqrtsd": 283, "clflush": 284, "pshufw": 285, "vrcpss": 286, "enter": 287, "vsubps": 288, "psubsb": 289, "fstp": 290, "movntdq": 291, "punpckhwd": 292, "cvtps2pi": 293, "fiadd": 294, "pfcmpge": 295, "setnp": 296, "pfrcp": 297, "psubw": 298, "movdq2q": 299, "lock": 300, "cmpsw": 301, "phaddw": 302, "sldt": 303, "pfsub": 304, "comisd": 305, "punpcklqdq": 306, "vcvttpd2dq": 307, "loopne": 308, "pop": 309, "lods": 310, "xadd": 311, "pblendvb": 312, "pcmpgtd": 313, "xorps": 314, "fcmovb": 315, "cmovge": 316, "movups": 317, "comiss": 318, "vdivps": 319, "pfnacc": 320, "fidiv": 321, "fucomi": 322, "fldenv": 323, "vmovaps": 324, "movntps": 325, "prefetchw": 326, "pmaddubsw": 327, "psubd": 328, "cmovns": 329, "pmulhuw": 330, "cmovs": 331, "setb": 332, "movlhps": 333, "movdqu": 334, "movzx": 335, "movmskpd": 336, "setle": 337, "psubsw": 338, "vshufps": 339, "prefetcht0": 340, "cmpnlesd": 341, "loop": 342, "cmpltsd": 343, "pswapd": 344, "vandnpd": 345, "unpcklpd": 346, "cld": 347, "cmovle": 348, "fldcw": 349, "lea": 350, "cmpxchg": 351, "fldz": 352, "vminsd": 353, "fcom": 354, "jz": 355, "cmpnlepd": 356, "shr": 357, "pminub": 358, "paddsb": 359, "fimul": 360, "vpsrad": 361, "rsqrtps": 362, "fxch7": 363, "minps": 364, "psubb": 365, "nop": 366, "call": 367, "minss": 368, "cvtss2sd": 369, "cvttps2pi": 370, "psrad": 371, "movntq": 372, "divps": 373, "vmovdqu": 374, "shld": 375, "cmplesd": 376, "stos": 377, "cvtss2si": 378, "vblendps": 379, "bts": 380, "mul": 381, "fisub": 382, "fcmove": 383, "retf": 384, "andpd": 385, "pinsrw": 386, "cmovg": 387, "pmullw": 388, "retfw": 389, "rcpps": 390, "vmread": 391, "sqrtps": 392, "maxss": 393, "jcxz": 394, "lsl": 395, "vpsllw": 396, "fisttp": 397, "packssdw": 398, "unpckhps": 399, "aad": 400, "lgdt": 401, "bt": 402, "vpermilps": 403, "pfmax": 404, "pfcmpgt": 405, "fucom": 406, "unpcklps": 407, "fbstp": 408, "psllq": 409, "movapd": 410, "palignr": 411, "fst": 412, "align": 413, "pextrd": 414, "vxorps": 415, "cvtps2dq": 416, "dec": 417, "ja": 418, "sal": 419, "movlpd": 420, "fisubr": 421, "phminposuw": 422, "andnps": 423, "pi2fd": 424, "movdqa": 425, "cmpxchg8b": 426, "vunpcklps": 427, "setnle": 428, "pf2id": 429, "fbld": 430, "jecxz": 431, "ficomp": 432, "punpckhbw": 433, "movd": 434, "fdivrp": 435, "loope": 436, "setp": 437, "mulsd": 438, "rsqrtss": 439, "pavgb": 440, "vmovups": 441, "fcmovnu": 442, "cvttss2si": 443, "les": 444, "xabort": 445, "neg": 446, "cmpneqpd": 447, "vpshuflw": 448, "pcmpeqb": 449, "setns": 450, "jle": 451, "pcmpgtb": 452, "dw": 453, "db": 454, "dd": 455, "stop_line": 456, "loc_": 457, "sub_": 458, "endp": 459}