{"0": "UNK", "1": "NONE", "2": "PAD", "3": "andps", "4": "psubusb", "5": "por", "6": "jnz", "7": "fxch4", "8": "pabsw", "9": "bsr", "10": "setl", "11": "paddw", "12": "fxsave", "13": "vmwrite", "14": "bound", "15": "jo", "16": "movhps", "17": "into", "18": "vmovd", "19": "pxor", "20": "vinsertf128", "21": "vmovdqa", "22": "paddsw", "23": "fist", "24": "orps", "25": "vmovapd", "26": "paddusw", "27": "roundps", "28": "fsub", "29": "bsf", "30": "fcmovu", "31": "vorpd", "32": "packuswb", "33": "unpckhpd", "34": "shufpd", "35": "pminuw", "36": "psubq", "37": "arpl", "38": "pandn", "39": "extractps", "40": "vpunpckhbw", "41": "vcvtss2sd", "42": "vpmullw", "43": "bswap", "44": "rcr", "45": "pmovzxbd", "46": "movsd", "47": "lddqu", "48": "movhpd", "49": "packusdw", "50": "jns", "51": "pshuflw", "52": "jnb", "53": "psllw", "54": "cvttps2dq", "55": "cmova", "56": "psrlq", "57": "setnbe", "58": "fcmovbe", "59": "leave", "60": "punpckldq", "61": "ffreep", "62": "phaddd", "63": "cmovb", "64": "insertps", "65": "scas", "66": "cmpps", "67": "sub", "68": "punpckhqdq", "69": "xchg", "70": "fcmovnbe", "71": "rol", "72": "pmulhrsw", "73": "fstsw", "74": "movnti", "75": "jnp", "76": "setz", "77": "int", "78": "minsd", "79": "paddusb", "80": "mulps", "81": "fcompp", "82": "vextractf128", "83": "lar", "84": "psrld", "85": "seto", "86": "vperm2f128", "87": "js", "88": "fadd", "89": "not", "90": "jmp", "91": "lss", "92": "paddq", "93": "fcmovnb", "94": "pfsubr", "95": "psrlw", "96": "punpckhdq", "97": "sqrtss", "98": "jg", "99": "pavgw", "100": "rcpss", "101": "cvtsd2si", "102": "pmaddwd", "103": "ucomisd", "104": "btr", "105": "cmovbe", "106": "vmovsd", "107": "jge", "108": "cmpneqps", "109": "vpaddw", "110": "sbb", "111": "cmovp", "112": "fcomi", "113": "idiv", "114": "pavgusb", "115": "jl", "116": "psubusw", "117": "fsubr", "118": "btc", "119": "pfadd", "120": "pshufb", "121": "addps", "122": "pand", "123": "imul", "124": "lidt", "125": "pshufhw", "126": "movaps", "127": "fild", "128": "lfs", "129": "addsd", "130": "lgs", "131": "addpd", "132": "vmptrst", "133": "vpcmpeqw", "134": "pshufd", "135": "fidivr", "136": "divss", "137": "prefetcht2", "138": "psrldq", "139": "shl", "140": "psraw", "141": "cvtdq2pd", "142": "pcmpgtw", "143": "vmovddup", "144": "subpd", "145": "movsx", "146": "vpcmpgtw", "147": "xor", "148": "fmul", "149": "cmp", "150": "movss", "151": "retnw", "152": "vpextrw", "153": "femms", "154": "rcl", "155": "wait", "156": "pslld", "157": "orpd", "158": "vunpckhps", "159": "pinsrd", "160": "xbegin", "161": "inc", "162": "ficom", "163": "sgdt", "164": "test", "165": "setbe", "166": "mpsadbw", "167": "prefetchnta", "168": "cmpleps", "169": "pcmpeqd", "170": "cmovl", "171": "ffree", "172": "fdivp", "173": "cmpltps", "174": "cvttsd2si", "175": "pmaxub", "176": "vsqrtpd", "177": "fistp", "178": "fnstenv", "179": "punpcklbw", "180": "vpmaddwd", "181": "fxch", "182": "cvtpd2ps", "183": "ucomiss", "184": "setno", "185": "sar", "186": "maxps", "187": "pmuludq", "188": "cvtps2pd", "189": "vpaddusw", "190": "fsubrp", "191": "movlps", "192": "fld1", "193": "jb", "194": "and", "195": "jbe", "196": "pcmpeqw", "197": "fnsave", "198": "cmovo", "199": "out", "200": "frstor", "201": "ldmxcsr", "202": "div", "203": "cvtpi2ps", "204": "mulpd", "205": "add", "206": "pextrw", "207": "movq", "208": "pextrb", "209": "punpcklwd", "210": "shufps", "211": "fdivr", "212": "cvtsd2ss", "213": "adc", "214": "movq2dq", "215": "cmpltpd", "216": "paddb", "217": "cmps", "218": "addss", "219": "vpunpckldq", "220": "pmovzxwd", "221": "vaddps", "222": "cmovno", "223": "pfmul", "224": "pmaxsw", "225": "subss", "226": "cvtsi2ss", "227": "subsd", "228": "cdq", "229": "stmxcsr", "230": "vmptrld", "231": "setnl", "232": "shrd", "233": "push", "234": "or", "235": "fucompp", "236": "cvtdq2ps", "237": "vpshufhw", "238": "fnstsw", "239": "pmulhw", "240": "vmulps", "241": "xlat", "242": "cvtsi2sd", "243": "cmovnp", "244": "subps", "245": "pslldq", "246": "ror", "247": "fcmovne", "248": "pfrcpit1", "249": "mulss", "250": "psadbw", "251": "movmskps", "252": "fcomp", "253": "fnstcw", "254": "jp", "255": "divsd", "256": "movhlps", "257": "fmulp", "258": "fdiv", "259": "pfrcpit2", "260": "jno", "261": "setnz", "262": "fld", "263": "in", "264": "paddd", "265": "cmpeqsd", "266": "str", "267": "lds", "268": "setnb", "269": "aam", "270": "packsswb", "271": "sets", "272": "pminsw", "273": "vdivsd", "274": "xorpd", "275": "faddp", "276": "lldt", "277": "andnpd", "278": "pmovmskb", "279": "fucomp", "280": "retn", "281": "mov", "282": "fsubp", "283": "sqrtsd", "284": "clflush", "285": "pshufw", "286": "vrcpss", "287": "enter", "288": "vsubps", "289": "psubsb", "290": "fstp", "291": "movntdq", "292": "punpckhwd", "293": "cvtps2pi", "294": "fiadd", "295": "pfcmpge", "296": "setnp", "297": "pfrcp", "298": "psubw", "299": "movdq2q", "300": "lock", "301": "cmpsw", "302": "phaddw", "303": "sldt", "304": "pfsub", "305": "comisd", "306": "punpcklqdq", "307": "vcvttpd2dq", "308": "loopne", "309": "pop", "310": "lods", "311": "xadd", "312": "pblendvb", "313": "pcmpgtd", "314": "xorps", "315": "fcmovb", "316": "cmovge", "317": "movups", "318": "comiss", "319": "vdivps", "320": "pfnacc", "321": "fidiv", "322": "fucomi", "323": "fldenv", "324": "vmovaps", "325": "movntps", "326": "prefetchw", "327": "pmaddubsw", "328": "psubd", "329": "cmovns", "330": "pmulhuw", "331": "cmovs", "332": "setb", "333": "movlhps", "334": "movdqu", "335": "movzx", "336": "movmskpd", "337": "setle", "338": "psubsw", "339": "vshufps", "340": "prefetcht0", "341": "cmpnlesd", "342": "loop", "343": "cmpltsd", "344": "pswapd", "345": "vandnpd", "346": "unpcklpd", "347": "cld", "348": "cmovle", "349": "fldcw", "350": "lea", "351": "cmpxchg", "352": "fldz", "353": "vminsd", "354": "fcom", "355": "jz", "356": "cmpnlepd", "357": "shr", "358": "pminub", "359": "paddsb", "360": "fimul", "361": "vpsrad", "362": "rsqrtps", "363": "fxch7", "364": "minps", "365": "psubb", "366": "nop", "367": "call", "368": "minss", "369": "cvtss2sd", "370": "cvttps2pi", "371": "psrad", "372": "movntq", "373": "divps", "374": "vmovdqu", "375": "shld", "376": "cmplesd", "377": "stos", "378": "cvtss2si", "379": "vblendps", "380": "bts", "381": "mul", "382": "fisub", "383": "fcmove", "384": "retf", "385": "andpd", "386": "pinsrw", "387": "cmovg", "388": "pmullw", "389": "retfw", "390": "rcpps", "391": "vmread", "392": "sqrtps", "393": "maxss", "394": "jcxz", "395": "lsl", "396": "vpsllw", "397": "fisttp", "398": "packssdw", "399": "unpckhps", "400": "aad", "401": "lgdt", "402": "bt", "403": "vpermilps", "404": "pfmax", "405": "pfcmpgt", "406": "fucom", "407": "unpcklps", "408": "fbstp", "409": "psllq", "410": "movapd", "411": "palignr", "412": "fst", "413": "align", "414": "pextrd", "415": "vxorps", "416": "cvtps2dq", "417": "dec", "418": "ja", "419": "sal", "420": "movlpd", "421": "fisubr", "422": "phminposuw", "423": "andnps", "424": "pi2fd", "425": "movdqa", "426": "cmpxchg8b", "427": "vunpcklps", "428": "setnle", "429": "pf2id", "430": "fbld", "431": "jecxz", "432": "ficomp", "433": "punpckhbw", "434": "movd", "435": "fdivrp", "436": "loope", "437": "setp", "438": "mulsd", "439": "rsqrtss", "440": "pavgb", "441": "vmovups", "442": "fcmovnu", "443": "cvttss2si", "444": "les", "445": "xabort", "446": "neg", "447": "cmpneqpd", "448": "vpshuflw", "449": "pcmpeqb", "450": "setns", "451": "jle", "452": "pcmpgtb", "453": "dw", "454": "db", "455": "dd", "456": "stop_line", "457": "loc_", "458": "sub_", "459": "endp"}